In [2]:
import pandas as pd

In [ ]:
# 2 main pandas structures

#Series
#dataframes

In [4]:
#SERIES

import pandas as pd
data= [10,20,30,40]

series = pd.Series(data)
print(series)

0    10
1    20
2    30
3    40
dtype: int64

In [6]:
import pandas as pd

data = ['Tanaji', 'More', "Jaipur"]

series = pd.Series(data)
print(series)

0    Tanaji
1      More
2    Jaipur
dtype: str

In [7]:
#Data Frames

import pandas as pd

data = {
    "Name": ["Tanaji", "Amit", "Sidhu"],
    "Age": [22,23,21],
    "City": ["Pune", "Mumbai", "Sangola"]
}

df = pd.DataFrame(data)
print(df)

     Name  Age     City
0  Tanaji   22     Pune
1    Amit   23   Mumbai
2   Sidhu   21  Sangola

In [11]:
# Read CSV File (MOST USED)

import pandas as pd

df = pd.read_csv("data.csv")

print(df)

     Name  Age  Salary
0  Tanaji   25   50000
1   Rahul   30   60000
2    Amit   28   55000
3  Yogesh   30   20400
4    Akki   21   45990
5   Sidhu   24  100000
6    Joan   24   34500
7    Mike   45   55000
8    Cena   34   45000

In [21]:
# View Data
#first 5 rows

import pandas as pd

df = pd.read_csv("data.csv")

df.head() # first 5 record

     Name  Age  Salary
0  Tanaji   25   50000
1   Rahul   30   60000
2    Amit   28   55000
3  Yogesh   30   20400
4    Akki   21   45990

In [22]:
df.tail()

    Name  Age  Salary
4   Akki   21   45990
5  Sidhu   24  100000
6   Joan   24   34500
7   Mike   45   55000
8   Cena   34   45000

In [23]:
df.columns

Index(['Name', 'Age', 'Salary'], dtype='str')

In [25]:
df.describe()

             Age         Salary
count   9.000000       9.000000
mean   29.000000   51765.555556
std     7.193747   21735.441743
min    21.000000   20400.000000
25%    24.000000   45000.000000
50%    28.000000   50000.000000
75%    30.000000   55000.000000
max    45.000000  100000.000000

In [26]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    9 non-null      str
 1   Age     9 non-null      int64
 2   Salary  9 non-null      int64
dtypes: int64(2), str(1)
memory usage: 348.0 bytes

In [ ]:
df["Name"] # Single column

0    Tanaji
1     Rahul
2      Amit
3    Yogesh
4      Akki
5     Sidhu
6      Joan
7      Mike
8      Cena
Name: Name, dtype: str

In [31]:

#Multiple columns
df[["Name","Age"]]

     Name  Age
0  Tanaji   25
1   Rahul   30
2    Amit   28
3  Yogesh   30
4    Akki   21
5   Sidhu   24
6    Joan   24
7    Mike   45
8    Cena   34

In [34]:
# Select Rows - Specific

df.loc[2]

Name       Amit
Age          28
Salary    55000
Name: 2, dtype: object

In [35]:
df.loc[0:2]

     Name  Age  Salary
0  Tanaji   25   50000
1   Rahul   30   60000
2    Amit   28   55000

In [39]:
#Filter Data (VERY IMPORTANT)

df[df['Salary'] >= 50000]

     Name  Age  Salary
0  Tanaji   25   50000
1   Rahul   30   60000
2    Amit   28   55000
5   Sidhu   24  100000
7    Mike   45   55000

In [41]:
#Add New Column

df["Bonus"] = df["Salary"] * 0.10
print(df)

     Name  Age  Salary    Bonus
0  Tanaji   25   50000   5000.0
1   Rahul   30   60000   6000.0
2    Amit   28   55000   5500.0
3  Yogesh   30   20400   2040.0
4    Akki   21   45990   4599.0
5   Sidhu   24  100000  10000.0
6    Joan   24   34500   3450.0
7    Mike   45   55000   5500.0
8    Cena   34   45000   4500.0

In [43]:
# Basic Analysis
# Average salary
df["Salary"].mean()

np.float64(51765.555555555555)

In [44]:
# Maximum salary
df["Salary"].max()

np.int64(100000)

In [59]:
import pandas as pd
# Read file
df = pd.read_csv("employees.csv")
print(df)

# Show first 3 rows
print(df[0:3])

# Show only Name and Salary columns
print(df[['Name','Salary']])

#Avg salary
df["Salary"].mean()

#Filter employees with Salary > 52000
df[df["Salary"] >52000]

     Name  Age  Salary    City
0  Tanaji   25   50000    Pune
1   Rahul   30   60000  Mumbai
2    Amit   28   55000   Delhi
3   Priya   27   52000    Pune
     Name  Age  Salary    City
0  Tanaji   25   50000    Pune
1   Rahul   30   60000  Mumbai
2    Amit   28   55000   Delhi
     Name  Salary
0  Tanaji   50000
1   Rahul   60000
2    Amit   55000
3   Priya   52000

    Name  Age  Salary    City
1  Rahul   30   60000  Mumbai
2   Amit   28   55000   Delhi

In [61]:
import pandas as pd

data = {
    "Name":["Tanaji", "Rahul", "Amit", "Priya", "Sidhu"],
    "Age":[25, 30, 32, 45, 22],
    "Salary":[50000, 60000, 55000, 40000, 80000],
    "City":["Pune", "Mumbai", "Jaipur", "Delhi", "Pune"]
}

df = pd.DataFrame(data)
print(df)

     Name  Age  Salary    City
0  Tanaji   25   50000    Pune
1   Rahul   30   60000  Mumbai
2    Amit   32   55000  Jaipur
3   Priya   45   40000   Delhi
4   Sidhu   22   80000    Pune

In [76]:
# 1Ô∏è‚É£ Print the entire DataFrame

df.head(2)

     Name  Age  Salary    City
0  Tanaji   25   50000    Pune
1   Rahul   30   60000  Mumbai

In [77]:
df.tail(2)

    Name  Age  Salary   City
3  Priya   45   40000  Delhi
4  Sidhu   22   80000   Pune

In [70]:
# 4Ô∏è‚É£ Print column names
df.columns

Index(['Name', 'Age', 'Salary', 'City'], dtype='str')

In [71]:
# 5Ô∏è‚É£ Print basic information of DataFrame
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      str
 1   Age     5 non-null      int64
 2   Salary  5 non-null      int64
 3   City    5 non-null      str
dtypes: int64(2), str(2)
memory usage: 292.0 bytes

In [72]:
# 6Ô∏è‚É£ Select only "Name" column
df['Name']

0    Tanaji
1     Rahul
2      Amit
3     Priya
4     Sidhu
Name: Name, dtype: str

In [73]:
# 7Ô∏è‚É£ Select only "Salary" column
df["Salary"]

0    50000
1    60000
2    55000
3    40000
4    80000
Name: Salary, dtype: int64

In [75]:
# 9Ô∏è‚É£ Print data type of each column
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      str
 1   Age     5 non-null      int64
 2   Salary  5 non-null      int64
 3   City    5 non-null      str
dtypes: int64(2), str(2)
memory usage: 292.0 bytes

In [78]:
# üîü Print only "Age" column values
df[["Name", "City"]]

     Name    City
0  Tanaji    Pune
1   Rahul  Mumbai
2    Amit  Jaipur
3   Priya   Delhi
4   Sidhu    Pune

In [79]:
df.dtypes

Name        str
Age       int64
Salary    int64
City        str
dtype: object

In [81]:
df["Age"].values

array([25, 30, 32, 45, 22])

In [82]:
df.loc[0]

Name      Tanaji
Age           25
Salary     50000
City        Pune
Name: 0, dtype: object

In [83]:
df.loc[1]

Name       Rahul
Age           30
Salary     60000
City      Mumbai
Name: 1, dtype: object

In [86]:
df.loc[1:3]

    Name  Age  Salary    City
1  Rahul   30   60000  Mumbai
2   Amit   32   55000  Jaipur
3  Priya   45   40000   Delhi

In [88]:
df.loc[0, "Name"]

'Tanaji'

In [89]:
df.loc[3, "Salary"]

np.int64(40000)

In [90]:
df["Age"].mean()

np.float64(30.8)

In [93]:
df["Salary"].min()

np.int64(40000)

In [94]:
len(df)

5

In [95]:
df.shape[0]

5

In [96]:
df.shape[1]

4

In [98]:
df[df["Age"]<17]

Empty DataFrame
Columns: [Name, Age, Salary, City]
Index: []

In [99]:
df[df["Salary"]>52000]

    Name  Age  Salary    City
1  Rahul   30   60000  Mumbai
2   Amit   32   55000  Jaipur
4  Sidhu   22   80000    Pune

In [100]:
df[df["City"] =="Pune"]

     Name  Age  Salary  City
0  Tanaji   25   50000  Pune
4   Sidhu   22   80000  Pune

In [101]:
df[df["Age"] < 30]

     Name  Age  Salary  City
0  Tanaji   25   50000  Pune
4   Sidhu   22   80000  Pune

In [102]:
df[df["Salary"] == 55000]

   Name  Age  Salary    City
2  Amit   32   55000  Jaipur

In [107]:
# Create Age_after_5_years

df["Age_after_5_years"] = df["Age"] +5
print(df)

     Name  Age  Salary    City  Age_after_5_years Country
0  Tanaji   25   50000    Pune                 30   India
1   Rahul   30   60000  Mumbai                 35   India
2    Amit   32   55000  Jaipur                 37   India
3   Priya   45   40000   Delhi                 50   India
4   Sidhu   22   80000    Pune                 27   India

In [106]:
df["Country"] = "India"
print(df)

     Name  Age  Salary    City  Age_after_5_years Country
0  Tanaji   25   50000    Pune                 30   India
1   Rahul   30   60000  Mumbai                 35   India
2    Amit   32   55000  Jaipur                 37   India
3   Priya   45   40000   Delhi                 50   India
4   Sidhu   22   80000    Pune                 27   India

In [29]:
# Handling Missing values
import pandas as pd
data= {
    "Name": ["Tanaji", "Rahul", "Amit", "Priya", "Neha"],
    "Age": [25, 30, None, 27, 29],
    "Salary": [50000, 60000, 55000, None, 52000],
    "City": ["Pune", "Mumbai", "Delhi", "Pune", None]
}

df = pd.DataFrame(data)
print(df)

     Name   Age   Salary    City
0  Tanaji  25.0  50000.0    Pune
1   Rahul  30.0  60000.0  Mumbai
2    Amit   NaN  55000.0   Delhi
3   Priya  27.0      NaN    Pune
4    Neha  29.0  52000.0     NaN

In [111]:
# üü¢ 1. Handling Missing Values

df.isnull()

    Name    Age  Salary   City
0  False  False   False  False
1  False  False   False  False
2  False   True   False  False
3  False  False    True  False
4  False  False   False   True

In [112]:
# Count missing values
df.isnull().sum()

Name      0
Age       1
Salary    1
City      1
dtype: int64

In [113]:
# Remove rows with missing values

df_clean = df.dropna()
print(df_clean)

     Name   Age   Salary    City
0  Tanaji  25.0  50000.0    Pune
1   Rahul  30.0  60000.0  Mumbai

In [117]:
df["Age"] = df["Age"].fillna(0)
print(df)

     Name   Age   Salary    City
0  Tanaji  25.0  50000.0    Pune
1   Rahul  30.0  60000.0  Mumbai
2    Amit   0.0  55000.0   Delhi
3   Priya  27.0      NaN    Pune
4    Neha  29.0  52000.0     NaN

In [ ]:
df["City"] = df["City"].fillna("Unkown")
print(df)

     Name   Age   Salary    City
0  Tanaji  25.0  50000.0    Pune
1   Rahul  30.0  60000.0  Mumbai
2    Amit   0.0  55000.0   Delhi
3   Priya  27.0      NaN    Pune
4    Neha  29.0  52000.0       0

In [122]:
df['Salary'] = df['Salary'].fillna(0)
print(df)

     Name   Age   Salary    City
0  Tanaji  25.0  50000.0    Pune
1   Rahul  30.0  60000.0  Mumbai
2    Amit   0.0  55000.0   Delhi
3   Priya  27.0      0.0    Pune
4    Neha  29.0  52000.0       0

In [123]:
#sorting

df.sort_values('Age')

     Name   Age   Salary    City
2    Amit   0.0  55000.0   Delhi
0  Tanaji  25.0  50000.0    Pune
3   Priya  27.0      0.0    Pune
4    Neha  29.0  52000.0       0
1   Rahul  30.0  60000.0  Mumbai

In [126]:
df.sort_values("Salary", ascending=False)

     Name   Age   Salary    City
1   Rahul  30.0  60000.0  Mumbai
2    Amit   0.0  55000.0   Delhi
4    Neha  29.0  52000.0       0
0  Tanaji  25.0  50000.0    Pune
3   Priya  27.0      0.0    Pune

In [128]:
# sort multiple cloumn
df.sort_values(["City", "Salary"])

     Name   Age   Salary    City
4    Neha  29.0  52000.0       0
2    Amit   0.0  55000.0   Delhi
1   Rahul  30.0  60000.0  Mumbai
3   Priya  27.0      0.0    Pune
0  Tanaji  25.0  50000.0    Pune

In [26]:
#Rename column

df.rename(columns={"Salary": "Income"}, inplace=True)

print(df)

     Name   Age   Income    City
0  Tanaji  25.0  50000.0    Pune
1   Rahul  30.0  60000.0  Mumbai
2    Amit   NaN  55000.0   Delhi
3   Priya  27.0      NaN    Pune
4    Neha  29.0  52000.0     NaN

In [27]:
#Rename mul col

df.rename(columns={
    "Name":"Employee_Name",
    "Age":"Employee_Age"
}, inplace=True
)

print(df)

  Employee_Name  Employee_Age   Income    City
0        Tanaji          25.0  50000.0    Pune
1         Rahul          30.0  60000.0  Mumbai
2          Amit           NaN  55000.0   Delhi
3         Priya          27.0      NaN    Pune
4          Neha          29.0  52000.0     NaN

In [15]:
# 4. Dropping Columns and Rows
df.drop("City", axis=1, inplace=True)
print(df)

     Name   Age   Salary
0  Tanaji  25.0  50000.0
1   Rahul  30.0  60000.0
2    Amit   NaN  55000.0
3   Priya  27.0      NaN
4    Neha  29.0  52000.0

In [28]:
df.drop(["Employee_Name", "Income"], axis=1, inplace=True)

In [30]:
# Handling Missing values
import pandas as pd
data= {
    "Name": ["Tanaji", "Rahul", "Amit", "Priya", "Neha"],
    "Age": [25, 30, None, 27, 29],
    "Salary": [50000, 60000, 55000, None, 52000],
    "City": ["Pune", "Mumbai", "Delhi", "Pune", None]
}

df = pd.DataFrame(data)
print(df)

     Name   Age   Salary    City
0  Tanaji  25.0  50000.0    Pune
1   Rahul  30.0  60000.0  Mumbai
2    Amit   NaN  55000.0   Delhi
3   Priya  27.0      NaN    Pune
4    Neha  29.0  52000.0     NaN

In [31]:
# 5. Save Data to CSV

df.to_csv("output.csv", index=False)

In [38]:
new_df = pd.read_csv("employees.csv")
print(new_df)

     Name  Age  Salary    City
0  Tanaji   25   50000    Pune
1   Rahul   30   60000  Mumbai
2    Amit   28   55000   Delhi
3   Priya   27   52000    Pune
4   Sidhu   23   98000    Pune

In [3]:
import pandas as pd

df= pd.read_csv("employees.csv")

#check missing value

print(df.isnull().sum())

# fill missing value

df["Age"] = df["Age"].fillna(df["Age"].mean())

#sort data

df = df.sort_values("Salary", ascending=False)
print(df)

#save cleaned data

df.to_csv("Cleaned_data.csv")

Name      0
Age       0
Salary    0
City      0
dtype: int64
     Name  Age  Salary    City
4   Sidhu   23   98000    Pune
1   Rahul   30   60000  Mumbai
2    Amit   28   55000   Delhi
3   Priya   27   52000    Pune
0  Tanaji   25   50000    Pune

In [5]:
import pandas as pd

data = {
    "Name" : ["Tanaji", "Rahul", "Sidhu", "Amit", "Neha", "Priya"],
    "Age" : [25, 24, 30, None, 31, None],
    "Salary" :[50000, 60000, 55000, None, 45000, None],
    "City": ["Pune", "Mumbai", "Pune", "Delhi", None, "Pune"]
}

df = pd.DataFrame(data)
print(df)

     Name   Age   Salary    City
0  Tanaji  25.0  50000.0    Pune
1   Rahul  24.0  60000.0  Mumbai
2   Sidhu  30.0  55000.0    Pune
3    Amit   NaN      NaN   Delhi
4    Neha  31.0  45000.0     NaN
5   Priya   NaN      NaN    Pune

In [6]:
# 1. Count missing values

df.isnull().sum()

Name      0
Age       2
Salary    2
City      1
dtype: int64

In [7]:
# 2. Fill missing Salary with 0

df["Salary"] = df["Salary"].fillna(0)
print(df)

     Name   Age   Salary    City
0  Tanaji  25.0  50000.0    Pune
1   Rahul  24.0  60000.0  Mumbai
2   Sidhu  30.0  55000.0    Pune
3    Amit   NaN      0.0   Delhi
4    Neha  31.0  45000.0     NaN
5   Priya   NaN      0.0    Pune

In [13]:
# 3. Sort data by Name

df_sorted = df.sort_values("Name", ascending=False)
print(df_sorted)

     Name   Age   Salary    City
0  Tanaji  25.0  50000.0    Pune
2   Sidhu  30.0  55000.0    Pune
1   Rahul  24.0  60000.0  Mumbai
5   Priya   NaN      0.0    Pune
4    Neha  31.0  45000.0     NaN
3    Amit   NaN      0.0   Delhi

In [14]:
# 4. Rename City ‚Üí Location

df.rename(columns={"City": "Location"}, inplace=True)
print(df)

     Name   Age   Salary Location
0  Tanaji  25.0  50000.0     Pune
1   Rahul  24.0  60000.0   Mumbai
2   Sidhu  30.0  55000.0     Pune
3    Amit   NaN      0.0    Delhi
4    Neha  31.0  45000.0      NaN
5   Priya   NaN      0.0     Pune

In [16]:
df["Location"] = df["Location"].fillna("Unknown")
print(df)

     Name   Age   Salary Location
0  Tanaji  25.0  50000.0     Pune
1   Rahul  24.0  60000.0   Mumbai
2   Sidhu  30.0  55000.0     Pune
3    Amit   NaN      0.0    Delhi
4    Neha  31.0  45000.0  Unknown
5   Priya   NaN      0.0     Pune

In [17]:
df["Age"] = df["Age"].fillna(0)
print(df)

     Name   Age   Salary Location
0  Tanaji  25.0  50000.0     Pune
1   Rahul  24.0  60000.0   Mumbai
2   Sidhu  30.0  55000.0     Pune
3    Amit   0.0      0.0    Delhi
4    Neha  31.0  45000.0  Unknown
5   Priya   0.0      0.0     Pune

In [ ]:
# drop age column
# axis = 1 : Column
# axis = 0 : row
df.drop("Age", axis=1, inplace=True)
print(df)

     Name   Salary Location
0  Tanaji  50000.0     Pune
1   Rahul  60000.0   Mumbai
2   Sidhu  55000.0     Pune
3    Amit      0.0    Delhi
4    Neha  45000.0  Unknown
5   Priya      0.0     Pune

In [20]:
# 6. Save file as new_data.csv

df.to_csv("updated_employees.csv", index=False)

In [21]:
import pandas as pd

data= {
    "Name": ["Tanaji", "Rahul", "Amit", "Priya", "Neha", "Arjun"],
    "City": ["Pune", "Mumbai", "Pune", "Delhi", "Mumbai", "Pune"],
    "Department": ["IT", "HR", "IT", "Finance", "HR", "IT"],
    "Salary": [50000, 60000, 55000, 65000, 62000, 58000],
    "Age": [25, 30, 28, 32, 29, 27]
}

df = pd.DataFrame(data)
print(df)

     Name    City Department  Salary  Age
0  Tanaji    Pune         IT   50000   25
1   Rahul  Mumbai         HR   60000   30
2    Amit    Pune         IT   55000   28
3   Priya   Delhi    Finance   65000   32
4    Neha  Mumbai         HR   62000   29
5   Arjun    Pune         IT   58000   27

In [27]:
# 1. unique() ‚Üí Find Unique Values

df["City"].unique()

<StringArray>
['Pune', 'Mumbai', 'Delhi']
Length: 3, dtype: str

In [28]:
# count unique values

df["City"].nunique()

3

In [29]:
# 2. value_counts() ‚Üí Count Frequency

df['City'].value_counts()

City
Pune      3
Mumbai    2
Delhi     1
Name: count, dtype: int64

In [30]:
df["Department"].value_counts()

Department
IT         3
HR         2
Finance    1
Name: count, dtype: int64

In [40]:
# 3. Filtering with Multiple Conditions
# Example 1: Salary > 55000 AND City = Pune

df[(df["Salary"] > 55000) & (df["City"] == "Mumbai") | (df["City"] == "Pune")]

     Name    City Department  Salary  Age
0  Tanaji    Pune         IT   50000   25
1   Rahul  Mumbai         HR   60000   30
2    Amit    Pune         IT   55000   28
4    Neha  Mumbai         HR   62000   29
5   Arjun    Pune         IT   58000   27

In [46]:
# 2: Salary > 60000 OR Department = HR

df[(df["Salary"] > 60000) | (df["Department"] == "HR")]

    Name    City Department  Salary  Age
1  Rahul  Mumbai         HR   60000   30
3  Priya   Delhi    Finance   65000   32
4   Neha  Mumbai         HR   62000   29

In [47]:
# Age between 25 and 30

df[(df["Age"] >= 25) & (df["Age"] <= 30)]

     Name    City Department  Salary  Age
0  Tanaji    Pune         IT   50000   25
1   Rahul  Mumbai         HR   60000   30
2    Amit    Pune         IT   55000   28
4    Neha  Mumbai         HR   62000   29
5   Arjun    Pune         IT   58000   27

In [ ]:
# groupby() ‚Üí MOST IMPORTANT FUNCTION

# 1. Average salary per city


df.groupby("City")["Salary"].mean()

City
Delhi     65000.000000
Mumbai    61000.000000
Pune      54333.333333
Name: Salary, dtype: float64

In [ ]:
# 2 Total salary per department

df.groupby("Department")["Salary"].sum()

Department
Finance     65000
HR         122000
IT         163000
Name: Salary, dtype: int64

In [53]:
# 3: Count employees per department
df.groupby("Department")["Name"].count()

Department
Finance    1
HR         2
IT         3
Name: Name, dtype: int64

In [55]:
# 4: Multiple aggregations

df.groupby("City")["Salary"].agg(["mean", 'max', 'min'])

                mean    max    min
City
Delhi   65000.000000  65000  65000
Mumbai  61000.000000  62000  60000
Pune    54333.333333  58000  50000

In [58]:
import pandas as pd

data={
    "Name": ["Tanaji", "Rahul", "Amit", "Priya", "Neha", "Arjun", "Sneha", "Kiran"],
    "City": ["Pune", "Mumbai", "Pune", "Delhi", "Mumbai", "Pune", "Delhi", "Mumbai"],
    "Department": ["IT", "HR", "IT", "Finance", "HR", "IT", "Finance", "IT"],
    "Salary": [50000, 60000, 55000, 65000, 62000, 58000, 64000, 57000],
    "Age": [25, 30, 28, 32, 29, 27, 31, 26]
}

df = pd.DataFrame(data)
print(df)

     Name    City Department  Salary  Age
0  Tanaji    Pune         IT   50000   25
1   Rahul  Mumbai         HR   60000   30
2    Amit    Pune         IT   55000   28
3   Priya   Delhi    Finance   65000   32
4    Neha  Mumbai         HR   62000   29
5   Arjun    Pune         IT   58000   27
6   Sneha   Delhi    Finance   64000   31
7   Kiran  Mumbai         IT   57000   26

In [59]:
# 1Ô∏è‚É£ Find unique cities
df["City"].unique()

<StringArray>
['Pune', 'Mumbai', 'Delhi']
Length: 3, dtype: str

In [60]:
# 2Ô∏è‚É£ Find unique departments
df["Department"].unique()

<StringArray>
['IT', 'HR', 'Finance']
Length: 3, dtype: str

In [61]:
# 3Ô∏è‚É£ Count number of unique cities
df["City"].nunique()

3

In [63]:
# 4Ô∏è‚É£ Count number of unique departments
print("Unique Cities are: ", df["Department"].nunique())

Unique Cities are:  3

In [64]:
# 5Ô∏è‚É£ Store unique cities into a variable and print it

unique_cities= df["City"].unique()
print(unique_cities)

<StringArray>
['Pune', 'Mumbai', 'Delhi']
Length: 3, dtype: str

In [69]:
# 6Ô∏è‚É£ Count employees per city

print("Employees per city :")

df["City"].value_counts()

Employees per city :

City
Pune      3
Mumbai    3
Delhi     2
Name: count, dtype: int64

In [73]:
# 7Ô∏è‚É£ Count employees per department
df["Department"].value_counts()

Department
IT         4
HR         2
Finance    2
Name: count, dtype: int64

In [76]:
# 8Ô∏è‚É£ Find which city has highest number of employees

df["City"].value_counts().idxmax()

'Pune'

In [83]:
#9Ô∏è‚É£ Find which department has lowest employees
df["Department"].value_counts().idxmin()

df["Department"].value_counts().tail(1)

Department
Finance    2
Name: count, dtype: int64

In [85]:
# üîü Store department counts into a variable

dept_count = df["Department"].value_counts()
print(dept_count)

Department
IT         4
HR         2
Finance    2
Name: count, dtype: int64

In [87]:
#1Ô∏è‚É£1Ô∏è‚É£ Show employees with Salary > 60000

df[df["Salary"]> 60000]

    Name    City Department  Salary  Age
3  Priya   Delhi    Finance   65000   32
4   Neha  Mumbai         HR   62000   29
6  Sneha   Delhi    Finance   64000   31

In [88]:
# 1Ô∏è‚É£2Ô∏è‚É£ Show employees from Pune

df[df["City"]=="Pune"]

     Name  City Department  Salary  Age
0  Tanaji  Pune         IT   50000   25
2    Amit  Pune         IT   55000   28
5   Arjun  Pune         IT   58000   27

In [91]:
# 1Ô∏è‚É£3Ô∏è‚É£ Show employees from Mumbai with Salary > 58000

df[(df["Salary"] > 58000) & (df["City"] == "Mumbai")]

    Name    City Department  Salary  Age
1  Rahul  Mumbai         HR   60000   30
4   Neha  Mumbai         HR   62000   29

In [92]:
# 1Ô∏è‚É£4Ô∏è‚É£ Show employees from IT department

df[(df["Department"] == "IT")]

     Name    City Department  Salary  Age
0  Tanaji    Pune         IT   50000   25
2    Amit    Pune         IT   55000   28
5   Arjun    Pune         IT   58000   27
7   Kiran  Mumbai         IT   57000   26

In [93]:
#1Ô∏è‚É£5Ô∏è‚É£ Show employees from IT department with Salary > 55000

df[(df["Department"] == "IT") & (df["Salary"] > 55000)]

    Name    City Department  Salary  Age
5  Arjun    Pune         IT   58000   27
7  Kiran  Mumbai         IT   57000   26

In [95]:
#1Ô∏è‚É£6Ô∏è‚É£ Show employees with Age less than 30

df[(df["Age"] < 30)]

     Name    City Department  Salary  Age
0  Tanaji    Pune         IT   50000   25
2    Amit    Pune         IT   55000   28
4    Neha  Mumbai         HR   62000   29
5   Arjun    Pune         IT   58000   27
7   Kiran  Mumbai         IT   57000   26

In [96]:
# 1Ô∏è‚É£7Ô∏è‚É£ Show employees from Delhi OR Salary > 60000

df[(df["City"] == "Delhi") | (df["Salary"] > 60000)]

    Name    City Department  Salary  Age
3  Priya   Delhi    Finance   65000   32
4   Neha  Mumbai         HR   62000   29
6  Sneha   Delhi    Finance   64000   31

In [98]:
# 1Ô∏è‚É£8Ô∏è‚É£ Show employees between Age 25 and 30

df[(df["Age"] >=25) & (df["Age"]<=30)]

     Name    City Department  Salary  Age
0  Tanaji    Pune         IT   50000   25
1   Rahul  Mumbai         HR   60000   30
2    Amit    Pune         IT   55000   28
4    Neha  Mumbai         HR   62000   29
5   Arjun    Pune         IT   58000   27
7   Kiran  Mumbai         IT   57000   26

In [105]:
# 1Ô∏è‚É£9Ô∏è‚É£ Find average salary per city

df.groupby("City")["Salary"].mean()

City
Delhi     64500.000000
Mumbai    59666.666667
Pune      54333.333333
Name: Salary, dtype: float64

In [106]:
# 2Ô∏è‚É£0Ô∏è‚É£ Find average salary per department

df.groupby("Department")["Salary"].mean()

Department
Finance    64500.0
HR         61000.0
IT         55000.0
Name: Salary, dtype: float64

In [110]:
# 2Ô∏è‚É£1Ô∏è‚É£ Find total salary per city

df.groupby("City")["Salary"].sum()

City
Delhi     129000
Mumbai    179000
Pune      163000
Name: Salary, dtype: int64

In [112]:
# 2Ô∏è‚É£2Ô∏è‚É£ Find total salary per department

df.groupby("Department")["Salary"].sum()

Department
Finance    129000
HR         122000
IT         220000
Name: Salary, dtype: int64

In [116]:
# 2Ô∏è‚É£3Ô∏è‚É£ Count employees per city using groupby

df.groupby("City").size()

City
Delhi     2
Mumbai    3
Pune      3
dtype: int64

In [117]:
# 2Ô∏è‚É£4Ô∏è‚É£ Count employees per department using groupby
df.groupby("Department").size()

Department
Finance    2
HR         2
IT         4
dtype: int64

In [119]:
# 2Ô∏è‚É£5Ô∏è‚É£ Find maximum salary per city
df.groupby("City")["Salary"].max()

City
Delhi     65000
Mumbai    62000
Pune      58000
Name: Salary, dtype: int64

In [121]:
# 2Ô∏è‚É£6Ô∏è‚É£ Find minimum salary per department

df.groupby("Department")["Salary"].min()

Department
Finance    64000
HR         60000
IT         50000
Name: Salary, dtype: int64

In [122]:
# 2Ô∏è‚É£7Ô∏è‚É£ Find average age per city

df.groupby("City")["Age"].mean()

City
Delhi     31.500000
Mumbai    28.333333
Pune      26.666667
Name: Age, dtype: float64

In [124]:
# 2Ô∏è‚É£8Ô∏è‚É£ Find maximum age per department

df.groupby("Department")["Age"].max()

Department
Finance    32
HR         30
IT         28
Name: Age, dtype: int64